---
kind: method
id: M:Autodesk.Revit.DB.LeaderArrayIterator.#ctor
source: html/eb56e0f8-8842-561d-8847-428c4d124ede.htm
---
# Autodesk.Revit.DB.LeaderArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public LeaderArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.